tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'd12frosted/emacs-plus'

# brew 'm-cli' # https://github.com/rgcr/m-cli/blob/master/Readme.md
brew 'ag'
# brew 'diffuse' # for diffing 3+ files
brew 'emacs-plus'
brew 'fish'
brew 'git'
brew 'graphviz'
brew 'htop'
brew 'mtr'
brew 'nmap'
brew 'shellcheck'
brew 'tmux'
cask 'firefox'
cask 'font-source-code-pro'
cask 'font-jetbrains-mono'
cask 'iterm2'
# cask 'libreoffice'
cask 'p4v'
cask 'google-chrome'
cask 'moom'
