###################
# Kong packages
###################
brew 'git'
cask "vagrant"
cask "virtualbox"
cask "slack"

# The version of ruby we use
# you'll need to `brew link --force ruby@2.1` after this to install symlinks
# tap 'homebrew/versions'
# brew 'ruby@2.1'
# brew 'v8-315'

# for sharing screen grabs
# See https://sites.google.com/a/kongregate.com/wiki/skitch-setup for setup instructions
# cask 'skitch'

### ETL packages
brew 'postgresql' # for connecting to redshift
brew 'jq'
brew 'yq'
brew 'python3'
cask 'docker'
cask 'snowflake-snowsql'

### Kongregate repo requirements
brew 'mysql' # for the mysql2 gem
brew 'gpgme' # for the ruby-gpgme gem

# Optional packages
cask 'p4v'
brew 'awscli'
brew 'aws-shell'
brew 'awslogs'
brew 's3cmd'
# brew 'qcachegrind'
# brew 'pandoc'  # for previewing markup (aka github markdown)
# cask 'mactex' # for saving to pdf from pandoc
